app/controllers/api/v1/users_controller.rb

      def update

        @user = User.find(params[:id])
        #check that user have enough money
        if @user.amount >= user_params[:amount].to_f
          #check that transaction was successfully
          if transaction_result?(amount: 100, destination: 2)
            new_amount = @user.amount - user_params[:amount].to_f
            @user.update(amount: new_amount)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "amount" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["amount", 81.0], ["updated_at", "2021-11-29 01:14:06.915306"], ["id", 1]]